print("Hello World")

# 注释-------------------------------------------------------------

# 这是注释
'"这是注释"'
"""这是注释"""

# 加减乘除-----------------------------------------------------------

a = 10
b = 20
print(a + b)
print(a - b)
print(a * b)
print(a / b)
print(a / 0.11)
print(a // b)       # 整除


# 幂方运算------------------------------------------------------------

print(a ** (b / 10))
print(a ** 2)
print(a ** 0.5)

# 取模运算------------------------------------------------------------

print(a % b)

# 打印操作(print会自动)------------------------------------------------------------
# 输出内容加上自定义内容和输出变量类型可以使用f-string，用法是f'{变量名}'
print(f'变量 a 的类型：{type(a)}')
print(f'变量 b 转换成 str 的类型：{type(str(b))}')
print(f'变量 a 转换成 float 的类型：{type(float(a))}')

# 打印换行
print('66666666666\n')

# bool 类型----------------------------------------------------------

flag = True
print(f'变量 flag 的类型：{type(flag)}')

# 控制台输入----------------------------------------------------------

num = input()
print(f'输入的内容：{num}')
num = input('动态类型转换成 str ，请输入：')
print(f'输入的内容：{str(num)}  类型：{type(str(num))}')


